In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

dates=pd.date_range('20130101',periods=6)
dates

#date_range是pandas的一个方法。

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
?pd.date_range()
#可以查看该方法的用法。

In [4]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df
#np.random.randn(6,4)用来生成6行4列的标准正太分布数列

                   A         B         C         D
2013-01-01 -0.170378  0.603429  0.271953 -0.307458
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154
2013-01-03  1.734610 -1.880908 -1.411285  0.699110
2013-01-04  0.417770  1.439819 -0.374155 -1.644983
2013-01-05 -0.271914 -0.337900 -0.674226  1.699197
2013-01-06  1.001164 -1.285517 -0.409395  1.796215

In [5]:
df.dtypes
#查看数据类型

A    float64
B    float64
C    float64
D    float64
dtype: object

In [ ]:
df.head()
df.tail()
#查看数据前几个和后几个

In [6]:
df.index
#显示索引
df.columns
#显示列名

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.describe()
#描述性统计

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.396333 -0.439295 -0.446699  0.747873
std    0.831538  1.262044  0.572280  1.489144
min   -0.333254 -1.880908 -1.411285 -1.644983
25%   -0.246530 -1.257811 -0.608018 -0.055816
50%    0.123696 -0.756295 -0.391775  1.199153
75%    0.855316  0.368097 -0.155855  1.771960
max    1.734610  1.439819  0.271953  2.245154

In [8]:
df.T
#转置调换数据，相当于矩阵转置

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.170378   -0.333254    1.734610    0.417770   -0.271914    1.001164
B    0.603429   -1.174691   -1.880908    1.439819   -0.337900   -1.285517
C    0.271953   -0.083088   -1.411285   -0.374155   -0.674226   -0.409395
D   -0.307458    2.245154    0.699110   -1.644983    1.699197    1.796215

In [13]:
df.sort_index(axis=0,ascending=True)
#按轴排序
#?df.sort_index(axis=1,ascending=False)
#查看方法
#axis=0对应的是对左边一列的index进行排序，ascending=False代表降序，ascending=True代表升序
#axis=1对应的是对上边一行的index进行排序，同样的，ascending=False代表降序，ascending=True代表升序
#只对行标签和列标签进行排序。
#0表示index，即一行，1表示columns即一列

                   A         B         C         D
2013-01-01 -0.170378  0.603429  0.271953 -0.307458
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154
2013-01-03  1.734610 -1.880908 -1.411285  0.699110
2013-01-04  0.417770  1.439819 -0.374155 -1.644983
2013-01-05 -0.271914 -0.337900 -0.674226  1.699197
2013-01-06  1.001164 -1.285517 -0.409395  1.796215

In [14]:
df.sort_index(by='B')
#仅对B列数据进行排序

E:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

                   A         B         C         D
2013-01-03  1.734610 -1.880908 -1.411285  0.699110
2013-01-06  1.001164 -1.285517 -0.409395  1.796215
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154
2013-01-05 -0.271914 -0.337900 -0.674226  1.699197
2013-01-01 -0.170378  0.603429  0.271953 -0.307458
2013-01-04  0.417770  1.439819 -0.374155 -1.644983

In [ ]:
df.A
df.['A']
#取A列数据，返回一个序列

In [15]:
df[0:3]
#切片，使用默认索引，返回前三行
df['20130102':'20130104']
#使用新索引取对应行

                   A         B         C         D
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154
2013-01-03  1.734610 -1.880908 -1.411285  0.699110
2013-01-04  0.417770  1.439819 -0.374155 -1.644983

In [18]:
df.loc[dates[0]]
#取出第一行
df.loc[:,['A','B']]
#通过标签选择多列
df.loc['20130102':'20130104',['A','B']]
#按照行列标签切片

                   A         B
2013-01-02 -0.333254 -1.174691
2013-01-03  1.734610 -1.880908
2013-01-04  0.417770  1.439819

In [ ]:
#按照位置选择
df.iloc[3]
#取出第三行
df.iloc[3:5,0:2]
#取3-4行，1-2列

In [19]:
#布尔索引
df[df.A>0]
#先判断A列中大于0的数，再把这些行取出来

                   A         B         C         D
2013-01-03  1.734610 -1.880908 -1.411285  0.699110
2013-01-04  0.417770  1.439819 -0.374155 -1.644983
2013-01-06  1.001164 -1.285517 -0.409395  1.796215

In [21]:
#缺失值处理，pandas用np.nan表示缺失的诗句，默认不包含在计算中。
#重新索引允许更改/添加/删除指定轴上的索引。
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
#E列的第一个和第二个值赋值为1
df1

                   A         B         C         D    E
2013-01-01 -0.170378  0.603429  0.271953 -0.307458  1.0
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154  1.0
2013-01-03  1.734610 -1.880908 -1.411285  0.699110  NaN
2013-01-04  0.417770  1.439819 -0.374155 -1.644983  NaN

In [29]:
df1.dropna()
#?df1.dropna()
#df1.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
#参数axis=0表示行，axis=1表示列。 how='any'表示元素中包含空值，how='all'表示元素中全为空值。inplace表示十分替换
df1.dropna(how='any')
#默认axis=0表示删除行。

                   A         B         C         D    E
2013-01-01 -0.170378  0.603429  0.271953 -0.307458  1.0
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154  1.0

In [32]:
df1.fillna(value=5)
?df1.fillna(value=5)
#这里用5填充，实际中常用0，中位数，平均值填充

                   A         B         C         D    E
2013-01-01 -0.170378  0.603429  0.271953 -0.307458  1.0
2013-01-02 -0.333254 -1.174691 -0.083088  2.245154  1.0
2013-01-03  1.734610 -1.880908 -1.411285  0.699110  NaN
2013-01-04  0.417770  1.439819 -0.374155 -1.644983  NaN

In [36]:
#统计平均值
df.mean()
#每列的平均值
df.mean(1)
#每行的平均值
?df.mean()

In [38]:
#APPLY,将功能用于处理数据
df.apply(np.cumsum)
#列累加，就是第二列的结果等于第一列+第二列
df.apply(lambda x:x.max()-x.min())
#使用匿名函数求每列的最大值和最小值的差

A    2.067864
B    3.320727
C    1.683238
D    3.890137
dtype: float64

In [40]:
#对数据计数
#只有序列有value_counts()方法
df.A.value_counts()

-0.333254    1
 1.001164    1
-0.271914    1
 1.734610    1
 0.417770    1
-0.170378    1
Name: A, dtype: int64

In [43]:
#join加入操作，合并。
left =pd.DataFrame({'key':['apple','apple'],'lval':[1,2]})
#字典转为df结构
left
right =pd.DataFrame({'key':['apple','apple'],'lval':[4,5]})
right
pd.merge(left,right,on='key')
#链接之后的效果类似笛卡尔积

     key  lval_x  lval_y
0  apple       1       4
1  apple       1       5
2  apple       2       4
3  apple       2       5

In [44]:
left1=pd.DataFrame({'key':['apple','orange'],'lval':[1,2]})
right1=pd.DataFrame({'key':['apple','orange'],'lval':[4,5]})
pd.merge(left1,right1,on='key')
#按照key合并

      key  lval_x  lval_y
0   apple       1       4
1  orange       2       5

In [50]:
#分组group by
df=pd.DataFrame({
    'A':['apple','orange','apple','orange','apple','orange','apple','orange'],
    'B':['one','one','two','three','one','one','two','three'],
    'C':np.random.randn(8),
    'D':np.random.randn(8)
    })
df
df.groupby('A').sum()
df.groupby('B').sum()
df.groupby(['A','B']).sum()

                     C         D
A      B
apple  one   -0.926187 -0.149763
       two   -3.449968 -1.337488
orange one    0.180778 -1.703416
       three  0.109862  1.487152

In [ ]:
#stack堆的数据结构

In [57]:
#数据透视表，df为数据名，values表示统计值，index表示索引列名，columns？
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C             -2.919858  -0.950758  -0.544781  -0.530110  -0.359884  \
A      B
apple  one          NaN  -0.367303        NaN        NaN        NaN
       two    -0.103147        NaN        NaN  -1.234341        NaN
orange one          NaN        NaN  -0.251983        NaN        NaN
       three        NaN        NaN        NaN        NaN   1.801575

C              0.024571   0.469746   0.725558
A      B
apple  one     0.217539        NaN        NaN
       two          NaN        NaN        NaN
orange one          NaN        NaN  -1.451433
       three        NaN  -0.314423        NaN